In [1]:
people = {
    "first": ["Deepak", 'Ashif', 'Akshay'], 
    "last": ["Kumar", 'md', 'Krishna'], 
    "email": ["deepakkumar@gmail.com", 'mdashif@email.com', 'akshaykrishna@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first     last                    email
0  Deepak    Kumar    deepakkumar@gmail.com
1   Ashif       md        mdashif@email.com
2  Akshay  Krishna  akshaykrishna@email.com

In [5]:
df['first'] + ' ' + df['last']

0      Deepak Kumar
1          Ashif md
2    Akshay Krishna
dtype: object

In [6]:
df['full_name'] = df['first'] + ' ' + df['last']

In [7]:
df

    first     last                    email       full_name
0  Deepak    Kumar    deepakkumar@gmail.com    Deepak Kumar
1   Ashif       md        mdashif@email.com        Ashif md
2  Akshay  Krishna  akshaykrishna@email.com  Akshay Krishna

In [8]:
df.drop(columns=['first', 'last'], inplace=True)

In [9]:
df

                     email       full_name
0    deepakkumar@gmail.com    Deepak Kumar
1        mdashif@email.com        Ashif md
2  akshaykrishna@email.com  Akshay Krishna

In [10]:
df['full_name'].str.split(' ')

0      [Deepak, Kumar]
1          [Ashif, md]
2    [Akshay, Krishna]
Name: full_name, dtype: object

In [11]:
df['full_name'].str.split(' ', expand=True)

        0        1
0  Deepak    Kumar
1   Ashif       md
2  Akshay  Krishna

In [12]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [13]:
df

                     email       full_name   first     last
0    deepakkumar@gmail.com    Deepak Kumar  Deepak    Kumar
1        mdashif@email.com        Ashif md   Ashif       md
2  akshaykrishna@email.com  Akshay Krishna  Akshay  Krishna

In [14]:
## to a new row
df.append({'first': 'Nimi'}, ignore_index=True)

                     email       full_name   first     last
0    deepakkumar@gmail.com    Deepak Kumar  Deepak    Kumar
1        mdashif@email.com        Ashif md   Ashif       md
2  akshaykrishna@email.com  Akshay Krishna  Akshay  Krishna
3                      NaN             NaN    Nimi      NaN

In [15]:
people2 = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people2)

In [16]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [17]:
df.append(df2, ignore_index=True, sort=False)

                     email       full_name   first     last
0    deepakkumar@gmail.com    Deepak Kumar  Deepak    Kumar
1        mdashif@email.com        Ashif md   Ashif       md
2  akshaykrishna@email.com  Akshay Krishna  Akshay  Krishna
3       IronMan@avenge.com             NaN    Tony    Stark
4           Cap@avenge.com             NaN   Steve   Rogers

In [22]:
df = df.append(df2, ignore_index=True, sort=False)

In [23]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [24]:
df.drop(index=4)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [26]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers